{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2023/02/07/hello-world/"},{"title":"Hexo Configuration","text":"_config.yml ConfigurationUse ssh instead of https link when setting up deploy in _config.yml 1234deploy: type: git repo: git@github.com:username/username.github.io.git branch: main Troubleshoot for Permission to user1/repo.git denied to user2.MacOpen Keychain Access.app and delete corresponding saved password related to user2.","link":"/2023/02/08/Hexo-Configuration/"},{"title":"Slurm Cheatsheet","text":"Cheatsheet中文版 English Version Official Documentation (not that useful) Most used commandSubmit a task1sbatch job_script.sh Check all job status1squeue -u username Cancel a job1scancel job_id Useful Comment to Request Resources in Job Script12345678910#SBATCH --account=[account]#SBATCH --ntasks=[number_of_tasks]#SBATCH --cpus-per-task=[number_of_cpus_per_task]#SBATCH --nodes=[number_of_nodes]#SBATCH --gres=gpu:[gpu_model (optional)]:[number_of_gpus]#SBATCH --partition [name_of_the_partition]#SBATCH --job-name=[job_name]#SBATCH --time=[maximum_running_time]#SBATCH --mem=[maximum_usable_memory]#SBATCH --output=[output_file] DON’T set the output as slurm.output, the job will stuck somehow.","link":"/2023/02/08/Slurm-Cheatsheet/"}],"tags":[{"name":"Research, Others","slug":"Research-Others","link":"/tags/Research-Others/"},{"name":"Others","slug":"Others","link":"/tags/Others/"}],"categories":[],"pages":[{"title":"Curriculum Vitae","text":"EducationUniversity of Bristol, Phd Student, 2022.03 - nowUniversity of Bristol, Master of Science by Research, 2020.11 - 2022.03Beihang University, Bachelor of Science, 2016.09 - 2020.06Research InterestsMy reseach is in Natural Language Processing (NLP). I focus on reducing hallucinations in summaries and improving the faithfulness/factuality of summarisation models. Current neural summariser has achieved significant success in generating fluent summaries, but sometimes the summariser degenerates to a language model and makes up false facts, which makes the summary less applicable in practice. I am interested in how to avoid this degeneration for summrisers and how to enable the summariser to detect and correct the hallucinations automatically. ServicesEMNLP Conference ReviewerAACL Conference Reviewer","link":"/curriculum-vitae/index.html"},{"title":"YYX&#39;s Logger","text":"Yuxuan YeI am a PhD student at the Intelligent Information System Lab, University of Bristol. My research interests are mainly about Natural Language Processing (NLP) and Reinforcement Learning (RL). Before I started my PhD career, I did a master by research degree in the University of Bristol to assess myself whether enjoy the research life. Fortunately, I find doing research is not dull or miserable for me. I really enjoy the process of thinking, practicing, and attempting. In addition, I found my supervisor kind and supportive, therefore I decided to continue my research career as a PhD student in the same university.Before I came to the UK, I finished all my prior study in China. I received a Bachelor degree in Information and Computing Science at Beihang University, which is a top university in China. During the 4 years studying mathematics, I gradually realised that it was really not my cup of tea.","link":"/YYX-s-Logger/index.html"}]}